app/controllers/home_controller.rb

SELECT `tickers`.* FROM `tickers` ORDER BY `tickers`.`id` DESC LIMIT 1
UPDATE `tickers` SET `last_price` = 777.0, `lowest_sell` = 766.1, `high_buy` = 779.2, `open_price` = 773.4, `volume` = 7685.0, `updated_at` = '2013-09-17 10:54:14' WHERE `tickers`.`id` = 1
SELECT `news`.* FROM `news` ORDER BY `news`.`id` DESC LIMIT 1
---
  def index
  	@ticker = Ticker.last
  	Bitwin::ThirdPartyBt.data if @ticker.nil?
  	@ticker = Bitwin::ThirdPartyBt.data if @ticker.updated_at < 2.minutes.ago

  	@news = News.last