app/controllers/passwords_controller.rb

  def step1_post
    user = User.where(:username=>params[:username].to_s).first
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'gfds' ORDER BY `users`.`id` ASC LIMIT 1